In [1]:
%run helper/setup_notebook.ipynb

Successfully connected to universities database.

In [2]:
%%sql 

SHOW TABLES;

[('country',),
 ('ranking_criteria',),
 ('ranking_system',),
 ('university',),
 ('university_ranking_year',),
 ('university_year',)]

In [7]:
%%sql 
SELECT *
FROM country
LIMIT 1;

[(1, 'Argentina')]

In [9]:
%%sql 
SELECT *
FROM ranking_criteria
LIMIT 1;

[(1, 1, 'Teaching')]

In [11]:
%%sql 
SELECT *
FROM ranking_system
LIMIT 1;

[(1, 'Times Higher Education World University Ranking')]

In [12]:
%%sql 
SELECT *
FROM university
LIMIT 1;

[(1, 73, 'Harvard University')]

In [13]:
%%sql 
SELECT *
FROM university_ranking_year
LIMIT 1;

[(1, 1, 2011, 100)]

In [14]:
%%sql 
SELECT *
FROM university_year
LIMIT 1;

[(1, 2011, 20152, Decimal('8.90'), 25, None)]